{
  "pName": "Help",
  "code": "/*\n             __          __ __    _______    __ __  \n\t\t\t \\ \\        / / | |   |  ____|  | (_) |  \n\t\t\t  \\ \\  /\\  / /__| |__ | |__   __| |_| |_ \n\t\t\t   \\ \\/  \\/ / _ \\ '_ \\|  __| / _` | | __|\n\t\t\t    \\  /\\  /  __/ |_) | |___| (_| | | |_ \n \t\t\t     \\/  \\/ \\___|_.__/|______\\__,_|_|\\__|\n\tA SIMPLE CODEMIRROR EDITOR FOR CREATING SINGLE HTML FILE GAMES/APPS.\n\tBUTTONS:\n\t\tProject- This is name of your project.\n        \t     Click this to run the code in a new tab.\n            \t Hold Ctrl when clicking to rename the project.\n           \t \t Name the project \"new\" to get a blank project.\n   \t\tLoadProject- This Loads Projects you have saved containing your code and bookmarks.\n                 \t Load the Help.json file to read the help file again.\n    \tSaveProject- This saves your current project.\n    \tImport- This loads a html file into your project, erasing whatever was there previously.\n    \tExport- This saves a html file of your code.\n    \tKeyCode- while your mouse is hovering over this the javascript keycode of the key being pressed  \n        \t\t is shown.\n    \tCpicker- Brings up an html color-picker.  if you have it displaying the hex color value when you\n             click back on the code editor the color hex value is put in the clipboard to be pasted.\n    \tZoom In / Zoom Out-  Changes code editor text size.\n    \tFORMAT- This attempts to pretty-up the code.\n    \tbookmark buttons-  These allow you to save the cursor position in your code.  \n                           To change the bookmark button name hold Ctrl while clicking.\n                           To set the bookmark hold Shift while clicking and it will store\n                           the current cursors location to the button.\n*/\n",
  "bm1name": "bookmark1",
  "bm1line": "1",
  "bm1ch": "1",
  "bm2name": "bookmark2",
  "bm2line": "1",
  "bm2ch": "1",
  "bm3name": "bookmark3",
  "bm3line": "1",
  "bm3ch": "1",
  "bm4name": "bookmark4",
  "bm4line": "1",
  "bm4ch": "1",
  "bm5name": "bookmark5",
  "bm5line": "1",
  "bm5ch": "1",
  "bm6name": "bookmark6",
  "bm6line": "1",
  "bm6ch": "1",
  "bm7name": "bookmark7",
  "bm7line": "1",
  "bm7ch": "1",
  "bm8name": "bookmark8",
  "bm8line": "1",
  "bm8ch": "1",
  "bm9name": "bookmark9",
  "bm9line": "1",
  "bm9ch": "1",
  "bm10name": "bookmark10",
  "bm10line": "1",
  "bm10ch": "1"
}